# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'cmake'
brew 'ccache'
brew 'ninja'
brew 'dfu-util'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'pnpm'

# Apps
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dbngin'
cask 'iterm2'
cask 'phpstorm'
cask 'raycast'
cask 'ray'
cask 'spotify'
cask 'figma'
cask 'firefox'
cask 'gitkraken'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'postman'
cask 'arc'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-jetbrains-mono'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
